[
  {
    "id": "choose-right-size-lounge",
    "title": "How to Choose the Right Rug Size for Your Lounge",
    "date": "2025-09-01",
    "tags": ["Sizing", "Living room"],
    "excerpt": "Most living rooms in Gqeberha (Port Elizabeth) look better when the rug is larger than you think. Here is a simple way to get it right.",
    "content": "One of the most common questions we receive is: \"What size rug should I choose for my lounge?\" As a starting point, aim for a rug that allows at least the front legs of your sofa and chairs to sit on the rug. This visually connects the furniture and makes the room feel bigger. If the space allows, a rug large enough for all lounge furniture legs to sit on top creates a luxurious, hotel-like feel. \n\nAvoid floating a small rug in the middle of the room with all furniture off the rug – this can make the space feel disconnected. When in doubt, size up and use a quality underlay to keep the rug safely in place."
  },
  {
    "id": "wool-vs-synthetic",
    "title": "Wool vs Synthetic Rugs: Which Is Better?",
    "date": "2025-08-20",
    "tags": ["Materials"],
    "excerpt": "Both wool and synthetic rugs have strengths. The best choice depends on where you will use the rug and how you live.",
    "content": "Wool rugs are naturally resilient, flame-resistant and excellent at hiding soil, making them ideal for lounges and bedrooms. They can shed lightly at first, which is normal and usually settles with regular vacuuming. Synthetic rugs, on the other hand, are stain-resistant, budget-friendly and often lighter to move.\n\nFor busy family homes, synthetic rugs are often a practical choice, especially in dining rooms, playrooms and rental properties. For long-term investment pieces, particularly in lower-traffic areas, wool or hand-knotted rugs are hard to beat."
  },
  {
    "id": "vacuuming-tips",
    "title": "Vacuuming Tips That Protect Your Rug",
    "date": "2025-07-15",
    "tags": ["Care"],
    "excerpt": "Vacuuming correctly is one of the easiest ways to extend the life of your rug.",
    "content": "Regular vacuuming lifts surface dirt before it works its way into the fibres. For wool and hand-knotted rugs, use suction only (no rotating brush) to avoid unnecessary wear. Vacuum in the direction of the pile where possible and avoid catching the fringes. \n\nIf someone in your home has allergies, consider vacuuming the back of the rug from time to time as well and using a rug underlay to prevent dust from collecting underneath."
  },
  {
    "id": "stain-first-aid",
    "title": "Stain First-Aid for Spills on Rugs",
    "date": "2025-06-10",
    "tags": ["Care", "Stains"],
    "excerpt": "Quick action can make a big difference when something spills on your rug.",
    "content": "The first rule of rug stain treatment is: never rub aggressively. Start by blotting up as much of the spill as possible with white paper towel or a clean cloth. For water-based spills such as juice or tea, apply a little lukewarm water and continue blotting. For more complex stains, contact us for advice before using strong off-the-shelf products. \n\nIf you are unsure, it is usually safer to book a professional clean, especially for wool and hand-knotted rugs."
  }
]
